---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures
source: html/e0ee3416-f676-e553-bc52-2767fc776cbc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures

Failures related to component repeaters.

## Syntax (C#)
```csharp
public static class ComponentRepeaterFailures
```